{"format": "graph-model", "generatedBy": "2.10.0", "convertedBy": "TensorFlow.js Converter v3.20.0", "signature": {"inputs": {"x": {"name": "x:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "16000"}]}}}, "outputs": {"class_ids": {"name": "Identity:0", "dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "-1"}]}}, "predictions": {"name": "Identity_2:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "1"}]}}, "class_names": {"name": "Identity_1:0", "dtype": "DT_STRING", "tensorShape": {"dim": [{"size": "-1"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/GatherV2/params", "op": "Const", "attr": {"dtype": {"type": "DT_STRING"}, "value": {"tensor": {"dtype": "DT_STRING", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/ArgMax/dimension", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/GatherV2/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/stft/frame/zeros_like", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/stft/frame/concat/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/stft/frame/ones_like", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/stft/frame/floordiv_3/y", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/stft/frame/concat_1/values_1/1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/stft/frame/concat_1/axis", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/stft/frame/range_1/start", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/stft/frame/range_1/delta", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/stft/frame/floordiv_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/stft/frame/Reshape_2/shape/1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/stft/frame/Reshape_3", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}, {"size": "255"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/stft/frame/strided_slice", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/stft/frame/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/stft/frame/add/x", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/stft/frame/Reshape/shape_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{}]}}}}}, {"name": "StatefulPartitionedCall/stft/frame_step", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/stft/frame_length", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/stft/frame/packed", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/stft/frame/split/split_dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/stft/frame/concat_2/axis", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/stft/hann_window/sub_2", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "255"}]}}}}}, {"name": "StatefulPartitionedCall/stft/rfft/Pad/paddings", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}, {"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/stft/rfft/fft_length", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/strided_slice/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/sequential/resizing/resize/size", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "unknown", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "ConstantFolding/StatefulPartitionedCall/sequential/normalization/truediv_recip", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1"}, {"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/sequential/conv2d/Conv2D/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "1"}, {"size": "32"}]}}}}}, {"name": "StatefulPartitionedCall/sequential/conv2d_1/Conv2D/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/flatten/Const", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/sequential/dense/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "12544"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/dense_1/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "x", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "16000"}]}}}}, {"name": "StatefulPartitionedCall/stft/frame/Shape", "op": "Shape", "input": ["x"], "attr": {"out_type": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/stft/frame/split", "op": "SplitV", "input": ["StatefulPartitionedCall/stft/frame/Shape", "StatefulPartitionedCall/stft/frame/packed", "StatefulPartitionedCall/stft/frame/split/split_dim"], "attr": {"Tlen": {"type": "DT_INT32"}, "num_split": {"i": "3"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/stft/frame/Reshape", "op": "Reshape", "input": ["StatefulPartitionedCall/stft/frame/split:1", "StatefulPartitionedCall/stft/frame/Reshape/shape_1"], "attr": {"T": {"type": "DT_INT32"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/stft/frame/floordiv_3", "op": "FloorDiv", "input": ["StatefulPartitionedCall/stft/frame/Reshape", "StatefulPartitionedCall/stft/frame/floordiv_3/y"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/stft/frame/sub_2", "op": "Sub", "input": ["StatefulPartitionedCall/stft/frame/Reshape", "StatefulPartitionedCall/stft/frame_length"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/stft/frame/concat_1/values_1", "op": "Pack", "input": ["StatefulPartitionedCall/stft/frame/floordiv_3", "StatefulPartitionedCall/stft/frame/concat_1/values_1/1"], "attr": {"T": {"type": "DT_INT32"}, "axis": {"i": "0"}, "N": {"i": "2"}}}, {"name": "ConstantFolding/StatefulPartitionedCall/stft/frame/concat/values_1_const_axis", "op": "Const", "input": ["^StatefulPartitionedCall/stft/frame/floordiv_3"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/stft/frame/floordiv", "op": "FloorDiv", "input": ["StatefulPartitionedCall/stft/frame/sub_2", "StatefulPartitionedCall/stft/frame_step"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/stft/frame/concat_1", "op": "ConcatV2", "input": ["StatefulPartitionedCall/stft/frame/split", "StatefulPartitionedCall/stft/frame/concat_1/values_1", "StatefulPartitionedCall/stft/frame/split:2", "StatefulPartitionedCall/stft/frame/concat_1/axis"], "attr": {"N": {"i": "3"}, "T": {"type": "DT_INT32"}, "Tidx": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/stft/frame/concat/values_1", "op": "ExpandDims", "input": ["StatefulPartitionedCall/stft/frame/floordiv_3", "ConstantFolding/StatefulPartitionedCall/stft/frame/concat/values_1_const_axis"], "attr": {"T": {"type": "DT_INT32"}, "Tdim": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/stft/frame/add", "op": "AddV2", "input": ["StatefulPartitionedCall/stft/frame/add/x", "StatefulPartitionedCall/stft/frame/floordiv"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/stft/frame/concat", "op": "ConcatV2", "input": ["StatefulPartitionedCall/stft/frame/split", "StatefulPartitionedCall/stft/frame/concat/values_1", "StatefulPartitionedCall/stft/frame/split:2", "StatefulPartitionedCall/stft/frame/concat/axis"], "attr": {"N": {"i": "3"}, "Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/stft/frame/Maximum", "op": "Maximum", "input": ["StatefulPartitionedCall/stft/frame/Const", "StatefulPartitionedCall/stft/frame/add"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/stft/frame/StridedSlice", "op": "StridedSlice", "input": ["x", "StatefulPartitionedCall/stft/frame/zeros_like", "StatefulPartitionedCall/stft/frame/concat", "StatefulPartitionedCall/stft/frame/ones_like"], "attr": {"shrink_axis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "begin_mask": {"i": "0"}, "end_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/stft/frame/range_1", "op": "Range", "input": ["StatefulPartitionedCall/stft/frame/range_1/start", "StatefulPartitionedCall/stft/frame/Maximum", "StatefulPartitionedCall/stft/frame/range_1/delta"], "attr": {"Tidx": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/stft/frame/Reshape_2/shape", "op": "Pack", "input": ["StatefulPartitionedCall/stft/frame/Maximum", "StatefulPartitionedCall/stft/frame/Reshape_2/shape/1"], "attr": {"T": {"type": "DT_INT32"}, "N": {"i": "2"}, "axis": {"i": "0"}}}, {"name": "StatefulPartitionedCall/stft/frame/packed_1", "op": "Pack", "input": ["StatefulPartitionedCall/stft/frame/Maximum", "StatefulPartitionedCall/stft/frame_length"], "attr": {"axis": {"i": "0"}, "N": {"i": "2"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/stft/frame/Reshape_1", "op": "Reshape", "input": ["StatefulPartitionedCall/stft/frame/StridedSlice", "StatefulPartitionedCall/stft/frame/concat_1"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/stft/frame/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/stft/frame/range_1", "StatefulPartitionedCall/stft/frame/floordiv_2"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/stft/frame/concat_2", "op": "ConcatV2", "input": ["StatefulPartitionedCall/stft/frame/split", "StatefulPartitionedCall/stft/frame/packed_1", "StatefulPartitionedCall/stft/frame/split:2", "StatefulPartitionedCall/stft/frame/concat_2/axis"], "attr": {"T": {"type": "DT_INT32"}, "N": {"i": "3"}, "Tidx": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/stft/frame/Reshape_2", "op": "Reshape", "input": ["StatefulPartitionedCall/stft/frame/mul_1", "StatefulPartitionedCall/stft/frame/Reshape_2/shape"], "attr": {"T": {"type": "DT_INT32"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/stft/frame/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/stft/frame/Reshape_2", "StatefulPartitionedCall/stft/frame/Reshape_3"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/stft/frame/GatherV2", "op": "GatherV2", "input": ["StatefulPartitionedCall/stft/frame/Reshape_1", "StatefulPartitionedCall/stft/frame/add_1", "StatefulPartitionedCall/stft/frame/strided_slice"], "attr": {"batch_dims": {"i": "0"}, "Tparams": {"type": "DT_FLOAT"}, "Tindices": {"type": "DT_INT32"}, "Taxis": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/stft/frame/Reshape_4", "op": "Reshape", "input": ["StatefulPartitionedCall/stft/frame/GatherV2", "StatefulPartitionedCall/stft/frame/concat_2"], "attr": {"Tshape": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/stft/mul", "op": "Mul", "input": ["StatefulPartitionedCall/stft/frame/Reshape_4", "StatefulPartitionedCall/stft/hann_window/sub_2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/stft/rfft/Pad", "op": "Pad", "input": ["StatefulPartitionedCall/stft/mul", "StatefulPartitionedCall/stft/rfft/Pad/paddings"], "attr": {"Tpaddings": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/stft/rfft", "op": "RFFT", "input": ["StatefulPartitionedCall/stft/rfft/Pad", "StatefulPartitionedCall/stft/rfft/fft_length"], "attr": {"Treal": {"type": "DT_FLOAT"}, "Tcomplex": {"type": "DT_COMPLEX64"}}}, {"name": "StatefulPartitionedCall/Abs", "op": "ComplexAbs", "input": ["StatefulPartitionedCall/stft/rfft"], "attr": {"Tout": {"type": "DT_FLOAT"}, "T": {"type": "DT_COMPLEX64"}}}, {"name": "StatefulPartitionedCall/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/Abs", "StatefulPartitionedCall/strided_slice/stack", "StatefulPartitionedCall/strided_slice/stack_1", "StatefulPartitionedCall/strided_slice/stack_2"], "attr": {"end_mask": {"i": "0"}, "T": {"type": "DT_FLOAT"}, "begin_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "new_axis_mask": {"i": "2"}, "ellipsis_mask": {"i": "1"}, "shrink_axis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/sequential/resizing/resize/ResizeBilinear", "op": "ResizeBilinear", "input": ["StatefulPartitionedCall/strided_slice", "StatefulPartitionedCall/sequential/resizing/resize/size"], "attr": {"T": {"type": "DT_FLOAT"}, "half_pixel_centers": {"b": true}, "align_corners": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential/normalization/sub", "op": "Sub", "input": ["StatefulPartitionedCall/sequential/resizing/resize/ResizeBilinear", "unknown"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/normalization/truediv", "op": "Mul", "input": ["StatefulPartitionedCall/sequential/normalization/sub", "ConstantFolding/StatefulPartitionedCall/sequential/normalization/truediv_recip"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/conv2d/Conv2D", "op": "Conv2D", "input": ["StatefulPartitionedCall/sequential/normalization/truediv", "StatefulPartitionedCall/sequential/conv2d/Conv2D/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"use_cudnn_on_gpu": {"b": true}, "T": {"type": "DT_FLOAT"}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "VkFMSUQ="}, "data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/sequential/conv2d/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/sequential/conv2d/Conv2D"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/conv2d_1/Conv2D", "op": "Conv2D", "input": ["StatefulPartitionedCall/sequential/conv2d/Relu", "StatefulPartitionedCall/sequential/conv2d_1/Conv2D/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "VkFMSUQ="}, "T": {"type": "DT_FLOAT"}, "use_cudnn_on_gpu": {"b": true}}}, {"name": "StatefulPartitionedCall/sequential/max_pooling2d/MaxPool", "op": "MaxPool", "input": ["StatefulPartitionedCall/sequential/conv2d_1/Conv2D"], "attr": {"T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "padding": {"s": "VkFMSUQ="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "data_format": {"s": "TkhXQw=="}, "ksize": {"list": {"i": ["1", "2", "2", "1"]}}}}, {"name": "StatefulPartitionedCall/sequential/conv2d_1/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/sequential/max_pooling2d/MaxPool"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/flatten/Reshape", "op": "Reshape", "input": ["StatefulPartitionedCall/sequential/conv2d_1/Relu", "StatefulPartitionedCall/sequential/flatten/Const"], "attr": {"Tshape": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/dense/MatMul", "op": "MatMul", "input": ["StatefulPartitionedCall/sequential/flatten/Reshape", "StatefulPartitionedCall/sequential/dense/MatMul/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "transpose_b": {"b": false}, "transpose_a": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential/dense/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/sequential/dense/MatMul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/dense_1/MatMul", "op": "MatMul", "input": ["StatefulPartitionedCall/sequential/dense/Relu", "StatefulPartitionedCall/sequential/dense_1/MatMul/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/ArgMax", "op": "ArgMax", "input": ["StatefulPartitionedCall/sequential/dense_1/MatMul", "StatefulPartitionedCall/ArgMax/dimension"], "attr": {"output_type": {"type": "DT_INT64"}, "Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "Identity_2", "op": "Identity", "input": ["StatefulPartitionedCall/sequential/dense_1/MatMul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/ArgMax"], "attr": {"T": {"type": "DT_INT64"}}}, {"name": "StatefulPartitionedCall/GatherV2", "op": "GatherV2", "input": ["StatefulPartitionedCall/GatherV2/params", "StatefulPartitionedCall/ArgMax", "StatefulPartitionedCall/GatherV2/axis"], "attr": {"Tparams": {"type": "DT_STRING"}, "Taxis": {"type": "DT_INT32"}, "Tindices": {"type": "DT_INT64"}, "batch_dims": {"i": "0"}}}, {"name": "Identity_1", "op": "Identity", "input": ["StatefulPartitionedCall/GatherV2"], "attr": {"T": {"type": "DT_STRING"}}}], "library": {}, "versions": {"producer": 1205}}, "weightsManifest": [{"paths": ["group1-shard1of2.bin", "group1-shard2of2.bin"], "weights": [{"name": "StatefulPartitionedCall/GatherV2/params", "shape": [1], "dtype": "string"}, {"name": "StatefulPartitionedCall/ArgMax/dimension", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/GatherV2/axis", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/stft/frame/zeros_like", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/stft/frame/concat/axis", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/stft/frame/ones_like", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/stft/frame/floordiv_3/y", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/stft/frame/concat_1/values_1/1", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/stft/frame/concat_1/axis", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/stft/frame/range_1/start", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/stft/frame/range_1/delta", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/stft/frame/floordiv_2", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/stft/frame/Reshape_2/shape/1", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/stft/frame/Reshape_3", "shape": [1, 255], "dtype": "int32"}, {"name": "StatefulPartitionedCall/stft/frame/strided_slice", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/stft/frame/Const", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/stft/frame/add/x", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/stft/frame/Reshape/shape_1", "shape": [0], "dtype": "int32"}, {"name": "StatefulPartitionedCall/stft/frame_step", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/stft/frame_length", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/stft/frame/packed", "shape": [3], "dtype": "int32"}, {"name": "StatefulPartitionedCall/stft/frame/split/split_dim", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/stft/frame/concat_2/axis", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/stft/hann_window/sub_2", "shape": [255], "dtype": "float32"}, {"name": "StatefulPartitionedCall/stft/rfft/Pad/paddings", "shape": [3, 2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/stft/rfft/fft_length", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/strided_slice/stack", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/strided_slice/stack_1", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/strided_slice/stack_2", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential/resizing/resize/size", "shape": [2], "dtype": "int32"}, {"name": "unknown", "shape": [1, 1, 1, 1], "dtype": "float32"}, {"name": "ConstantFolding/StatefulPartitionedCall/sequential/normalization/truediv_recip", "shape": [1, 1, 1, 1], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential/conv2d/Conv2D/ReadVariableOp", "shape": [3, 3, 1, 32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential/conv2d_1/Conv2D/ReadVariableOp", "shape": [3, 3, 32, 64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential/flatten/Const", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential/dense/MatMul/ReadVariableOp", "shape": [12544, 128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential/dense_1/MatMul/ReadVariableOp", "shape": [128, 1], "dtype": "float32"}, {"name": "ConstantFolding/StatefulPartitionedCall/stft/frame/concat/values_1_const_axis", "shape": [], "dtype": "int32"}]}]}